import src from "../components/images/tools/1-2.jpg";
import src1 from "../components/images/tools/1.jpg";
import src2 from "../components/images/tools/ekran.jpg";
import src3 from "../components/images/tools/ekran1.jpg";
import src4 from "../components/images/tools/2.jpg";
import src5 from "../components/images/tools/2-2.jpg";
import src6 from "../components/images/tools/3.jpg";
import sk from "../components/images/tools/sk.jpg";
import sk1 from "../components/images/tools/sk1.jpg";
import hsk from "../components/images/tools/hsk.jpg";
import hsk1 from "../components/images/tools/hsk1.jpg";
import capto from "../components/images/tools/capto.jpg";
import capto1 from "../components/images/tools/capto1.jpg";
import vidi from "../components/images/tools/vidi.jpg";
import vidi1 from "../components/images/tools/vidi1.jpg";

const state = {
  katalog: [
    {
      index: 0,
      id: "HSK 40-231912.40",
      name: "HSK 40",
      title:
        "Приспособление повортно-фиксирующее для сборки оправок и патронов",
      subTitle:
        "С комплектом крепления к столешницам .  С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг",
      ],
      massa: "1,5",
      price: "13 800 р",
      delivery: "600-1000р",
      imgsrc: hsk,
      slider: [hsk, hsk1, hsk, hsk1],
      cone: "BT40",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 1,
      id: "HSK 50-231912.50",
      name: "HSK 50",
      title:
        "Приспособление повортно-фиксирующее для сборки оправок и патронов",
      subTitle:
        "С комплектом крепления к столешницам .  С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,4кг",
      ],
      massa: "1,5",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: hsk,
      slider: [hsk, hsk1, hsk, hsk1],
      cone: "BT50",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 2,
      id: "HSK 63-231912.63",
      name: "HSK 63",
      title:
        "Приспособление повортно-фиксирующее для сборки оправок и патронов",
      subTitle:
        "С комплектом крепления к столешницам .  С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,51кг",
      ],
      massa: "1,5",
      price: "15 800 р",
      delivery: "600-1000р",
      imgsrc: hsk,
      slider: [hsk, hsk1, hsk, hsk1],
      cone: "HSK 63",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 3,
      id: "HSK 80- 231912.80",
      name: "HSK 80",
      title:
        "Приспособление повортно-фиксирующее для сборки оправок и патронов",
      subTitle:
        "С комплектом крепления к столешницам .  С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,53кг)",
      ],
      massa: "1,5",
      price: "17 500 р",
      delivery: "600-1000р",
      imgsrc: hsk,
      slider: [hsk, hsk1, hsk, hsk1],
      cone: "HSK 80",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 4,
      id: "HSK 100- 231912.100",
      name: "HSK 100",
      title:
        "Приспособление повортно-фиксирующее для сборки оправок и патронов",
      subTitle:
        "С комплектом крепления к столешницам .  С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,53кг)",
      ],
      massa: "1,5",
      price: "17 500 р",
      delivery: "600-1000р",
      imgsrc: hsk,
      slider: [hsk, hsk1, hsk, hsk1],
      cone: "HSK 100 ",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 5,
      id: "SK 30- 1912.30",
      name: "SK 30 ",
      title:
        "Приспособление поворотно-фиксирующее для сборки оправок и патронов для монтажа и демонтажа режущего инструмента и штревелей за один установ",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,59кг)",
      ],
      massa: "1,5",
      price: "13 800 р",
      delivery: "600-1000р",
      imgsrc: sk,
      slider: [sk, sk1, sk, sk1],
      cone: "SK 30",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 6,
      id: "SK 40- 1912.40",
      name: "SK 40",
      title:
        "Приспособление поворотно-фиксирующее для сборки оправок и патронов для монтажа и демонтажа режущего инструмента и штревелей за один установ",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,5",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: sk,
      slider: [sk, sk1, sk, sk1],
      cone: "SK 40",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 7,
      id: "SK 45- 1912.45",
      name: "SK 45",
      title:
        "Приспособление поворотно-фиксирующее для сборки оправок и патронов для монтажа и демонтажа режущего инструмента и штревелей за один установ",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,59",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: sk,
      slider: [sk, sk1, sk, sk1],
      cone: "SK 45",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 8,
      id: "SK 50- 1912.50",
      name: "SK 50",
      title:
        "Приспособление поворотно-фиксирующее для сборки оправок и патронов  для монтажа и демонтажа режущего инструмента и штревелей за один установ",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,59",
      price: "16 800 р",
      delivery: "600-1000р",
      imgsrc: sk,
      slider: [sk, sk1, sk, sk1],
      cone: "SK 50",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 9,
      id: "VDI25- 3510.25",
      name: "VDI25",
      title:
        "Приспособление повортно-фиксирующее для сборки держателей и приводных головок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,3",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: vidi,
      slider: [vidi, vidi1, vidi, vidi1],
      cone: "VDI25",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 10,
      id: "VDI30- 3510.30",
      name: "VDI30",
      title:
        "Приспособление повортно-фиксирующее для сборки держателей и приводных головок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,39",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: vidi,
      slider: [vidi, vidi1, vidi, vidi1],
      cone: "VDI30",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 11,
      id: "VDI40- 3510.40",
      name: "VDI40",
      title:
        "Приспособление повортно-фиксирующее для сборки держателей и приводных головок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,6",
      price: "14 800 р",
      delivery: "600-1000р",
      imgsrc: vidi,
      slider: [vidi, vidi1, vidi, vidi1],
      cone: "VDI40",
      discription:
        "Приспособление предназначено для удобной сборки цанговых патронов вне станка. А также для фиксации штревеля на оправке",
    },
    {
      index: 12,
      id: "Capto C 4 121172016.40",
      name: "Capto C 4",
      title:
        "Приспособление повортно-фиксирующее для сборки  держателей и оправок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,8",
      price: "30 800 р",
      delivery: "600-1000р",
      imgsrc: capto,
      slider: [capto, capto1, capto, capto1],
      cone: "Capto C 4",
      discription:
        "Приспособление предназначено для удобной сборки зажимных, оправок , патронов вне станка.",
    },
    {
      index: 13,
      id: "Capto C 5 121172016.50",
      name: "Capto C 5",
      title:
        "Приспособление повортно-фиксирующее для сборки  держателей и оправок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,8",
      price: "33 800 р",
      delivery: "600-1000р",
      imgsrc: capto,
      slider: [capto, capto1, capto, capto1],
      cone: "Capto C 5",
      discription:
        "Приспособление предназначено для удобной сборки зажимных, оправок , патронов вне станка.",
    },
    {
      index: 14,
      id: "Capto C 6 121172016.63",
      name: "Capto C 6",
      title:
        "Приспособление повортно-фиксирующее для сборки  держателей и оправок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,8",
      price: "35 800 р",
      delivery: "600-1000р",
      imgsrc: capto,
      slider: [capto, capto1, capto, capto1],
      cone: "Capto C 6",
      discription:
        "Приспособление предназначено для удобной сборки зажимных, оправок , патронов вне станка.",
    },
    {
      index: 15,
      id: "Capto C 8 121172016.80",
      name: "Capto C 8",
      title:
        "Приспособление повортно-фиксирующее для сборки  держателей и оправок",
      subTitle:
        "c комплектом крепления к столешницам. С индексацией угла поворота в 45° и 90°.",
      specifications: [
        "Материал - Сталь 40Х",
        "Термообработка узлов - 34-38HRC",
        "Покрытие изделия - Хим-окс.прм.,Хр,Цх",
        "Фурнитура и крепеж - WURTH(Германия)",
        "Вес 1,5кг)",
      ],
      massa: "1,8",
      price: "39 800 р",
      delivery: "600-1000р",
      imgsrc: capto,
      slider: [capto, capto1, capto, capto1],
      cone: "Capto C 8",
      discription:
        "Приспособление предназначено для удобной сборки зажимных, оправок , патронов вне станка.",
    },
  ],
  kart: [],
  options: [
    {
      id: "opt1",
      index: 0,
      title: "Опция 1",
      price: "1 000 р",
      slider: [src2],
    },
    {
      id: "opt2",
      index: 1,
      title: "Опция 2",
      price: "2 000 р",
      slider: [src3],
    },
  ],
};

export default state;
